In [1]:
import numpy as np
import pandas as pd
import sqlite3
import os
from pandasql import sqldf

In [2]:
# Link this to latest Data_SQL directory in the future

os.chdir(r'C:\Users\pwy_9\Downloads\1112_AWS\Data_SQL')

In [3]:
Customers = pd.read_excel("01 Customers.xlsx")
Categories = pd.read_excel("02 Categories.xlsx")
Employees = pd.read_excel("03 Employees.xlsx")
OrderDetails = pd.read_excel("04 Order Details.xlsx")
Orders = pd.read_excel("05 Orders.xlsx")
Products = pd.read_excel("06 Products.xlsx")
Shippers = pd.read_excel("07 Shippers.xlsx")
Suppliers = pd.read_excel("08 Suppliers.xlsx")

In [4]:
pysqldf = lambda q: sqldf(q, globals())

In [5]:
q = """ 

select C.Country, C.CustomerName,  c_val.CustOrderValue        
from Customers as C
left join(  select CustomerID, sum(OrderValue) as CustOrderValue
            from Orders as O
            left join ( select or_d.OrderID, sum((or_d.Quantity*p.Price)) as OrderValue
                        from OrderDetails as or_d
                        left join Products as p
                        on p.ProductID = or_d.ProductID
                        group by OrderID) as ord_val
            on O.OrderID = ord_val.OrderID
            group by CustomerID) as c_val
on C.CustomerID = c_val.CustomerID
order by Country, CustOrderValue Desc  

"""

In [6]:
pandaSQL_solution1 = pysqldf(q)

In [7]:
pandaSQL_solution1

      Country                       CustomerName  CustOrderValue
0   Argentina             Océano Atlántico Ltda.          399.00
1   Argentina         Cactus Comidas para llevar             NaN
2   Argentina                      Rancho grande             NaN
3     Austria                       Ernst Handel        35631.21
4     Austria                   Piccolo und mehr        16040.75
..        ...                                ...             ...
86        USA  Trail's Head Gourmet Provisioners             NaN
87  Venezuela                  LILA-Supermercado         7358.68
88  Venezuela                   HILARIÓN-Abastos         4320.50
89  Venezuela               GROSELLA-Restaurante         1377.10
90  Venezuela                   LINO-Delicateses          500.00

[91 rows x 3 columns]